ftkalcevic/DCC/STM32F469_Controller/Source/TouchGFX/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include "../Components/otm8009a/otm8009a.h"
#include "stm32469i_discovery_sdram.h"
#include "stm32469i_discovery_qspi.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef StaticTask_t osStaticThreadDef_t;
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* DISPLAY */
#define LCD_ORIENTATION_LANDSCAPE 0x01
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

CAN_HandleTypeDef hcan2;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

DSI_HandleTypeDef hdsi;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA1;

SD_HandleTypeDef hsd;
DMA_HandleTypeDef hdma_sdio_rx;
DMA_HandleTypeDef hdma_sdio_tx;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim8;
DMA_HandleTypeDef hdma_tim3_ch4_up;
DMA_HandleTypeDef hdma_tim8_up;

UART_HandleTypeDef huart3;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
uint32_t TouchGFXTaskBuffer[ 2048 ];
osStaticThreadDef_t TouchGFXTaskControlBlock;
const osThreadAttr_t TouchGFXTask_attributes = {
  .name = "TouchGFXTask",
  .stack_mem = &TouchGFXTaskBuffer[0],
  .stack_size = sizeof(TouchGFXTaskBuffer),
  .cb_mem = &TouchGFXTaskControlBlock,
  .cb_size = sizeof(TouchGFXTaskControlBlock),
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for SelfTestTask */
osThreadId_t SelfTestTaskHandle;
uint32_t SelfTestTaskBuffer[ 2048 ];
osStaticThreadDef_t SelfTestTaskControlBlock;
const osThreadAttr_t SelfTestTask_attributes = {
  .name = "SelfTestTask",
  .stack_mem = &SelfTestTaskBuffer[0],
  .stack_size = sizeof(SelfTestTaskBuffer),
  .cb_mem = &SelfTestTaskControlBlock,
  .cb_size = sizeof(SelfTestTaskControlBlock),
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for DCCTask */
osThreadId_t DCCTaskHandle;
uint32_t DCCTaskBuffer[ 128 ];
osStaticThreadDef_t DCCTaskControlBlock;
const osThreadAttr_t DCCTask_attributes = {
  .name = "DCCTask",
  .stack_mem = &DCCTaskBuffer[0],
  .stack_size = sizeof(DCCTaskBuffer),
  .cb_mem = &DCCTaskControlBlock,
  .cb_size = sizeof(DCCTaskControlBlock),
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for DCCTask_PrgTrk */
osThreadId_t DCCTask_PrgTrkHandle;
uint32_t DCCTask_PrgTrkBuffer[ 128 ];
osStaticThreadDef_t DCCTask_PrgTrkControlBlock;
const osThreadAttr_t DCCTask_PrgTrk_attributes = {
  .name = "DCCTask_PrgTrk",
  .stack_mem = &DCCTask_PrgTrkBuffer[0],
  .stack_size = sizeof(DCCTask_PrgTrkBuffer),
  .cb_mem = &DCCTask_PrgTrkControlBlock,
  .cb_size = sizeof(DCCTask_PrgTrkControlBlock),
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for AppMainTask */
osThreadId_t AppMainTaskHandle;
uint32_t AppMainTaskBuffer[ 4096 ];
osStaticThreadDef_t AppMainTaskControlBlock;
const osThreadAttr_t AppMainTask_attributes = {
  .name = "AppMainTask",
  .stack_mem = &AppMainTaskBuffer[0],
  .stack_size = sizeof(AppMainTaskBuffer),
  .cb_mem = &AppMainTaskControlBlock,
  .cb_size = sizeof(AppMainTaskControlBlock),
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for LCCTask */
osThreadId_t LCCTaskHandle;
uint32_t LCCTaskBuffer[ 4096 ];
osStaticThreadDef_t LCCTaskControlBlock;
const osThreadAttr_t LCCTask_attributes = {
  .name = "LCCTask",
  .stack_mem = &LCCTaskBuffer[0],
  .stack_size = sizeof(LCCTaskBuffer),
  .cb_mem = &LCCTaskControlBlock,
  .cb_size = sizeof(LCCTaskControlBlock),
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_DSIHOST_DSI_Init(void);
static void MX_FMC_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_I2C1_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_SAI1_Init(void);
void MX_ADC1_Init(void);
static void MX_CAN2_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI1_Init(void);
void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM8_Init(void);
static void MX_RTC_Init(void);
void TouchGFX_Task(void *argument);
void SelfTest_Task(void *argument);
extern void DCCTask_Entry(void *argument);
extern void AppMain_Task(void *argument);
extern void LCCTask_Entry(void *argument);

/* USER CODE BEGIN PFP */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


